WBTQ/NXPCUP/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for GPIO4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for INPUTMUX: Enables clock */
    CLOCK_EnableClock(kCLOCK_InputMux0);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    gpio_pin_config_t M1_INA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin L5)  */
    GPIO_PinInit(BOARD_M1_INA_GPIO, BOARD_M1_INA_PIN, &M1_INA_config);

    gpio_pin_config_t M2_INB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin J15)  */
    GPIO_PinInit(BOARD_M2_INB_GPIO, BOARD_M2_INB_PIN, &M2_INB_config);

    gpio_pin_config_t M1_INB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin M17)  */
    GPIO_PinInit(BOARD_M1_INB_GPIO, BOARD_M1_INB_PIN, &M1_INB_config);

    gpio_pin_config_t M2_INA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_13 (pin T7)  */
    GPIO_PinInit(BOARD_M2_INA_GPIO, BOARD_M2_INA_PIN, &M2_INA_config);
    /* PWM1_A0_TRIG0 is selected as trigger input for ADC0 channel 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_Pwm1A0Trig0ToAdc0Trigger);
    /* Ctimer input 2 is selected for TIMER0 CAPTSEL 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_CtimerInp2ToTimer0Captsel);
    /* Ctimer input 3 is selected for TIMER0 CAPTSEL 1 */
    INPUTMUX_AttachSignal(INPUTMUX0, 1U, kINPUTMUX_CtimerInp3ToTimer0Captsel);
    /* Ctimer input 2 is selected for TIMER0 CAPTSEL 2 */
    INPUTMUX_AttachSignal(INPUTMUX0, 2U, kINPUTMUX_CtimerInp2ToTimer0Captsel);
    /* Ctimer input 3 is selected for TIMER0 CAPTSEL 3 */
    INPUTMUX_AttachSignal(INPUTMUX0, 3U, kINPUTMUX_CtimerInp3ToTimer0Captsel);
    /* PIO1_22 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_GpioPort1Pin22ToPintsel);
    /* Pin interrupt 0 is selected as trigger input for QDC0 PHASEA channel 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_PinInt0ToQdc0Phasea);
    /* TRIG_IN5 is selected as trigger input for QDC0 PHASEB channel 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn5ToQdc0Phaseb);
    /* TRIG_IN6 is selected as trigger input for QDC1 PHASEA channel 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn6ToQdc1Phasea);
    /* TRIG_IN7 is selected as trigger input for QDC1 PHASEB channel 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn7ToQdc1Phaseb);

    const port_pin_config_t LED_RED = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = kPORT_LowDriveStrength,
                                       /* Pin is configured as PIO0_10 */
                                       .mux = kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       .inputBuffer = kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       .invertInput = kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = kPORT_UnlockRegister};
    /* PORT0_10 (pin B12) is configured as PIO0_10 */
    PORT_SetPinConfig(BOARD_LED_RED_PORT, BOARD_LED_RED_PIN, &LED_RED);

    /* PORT0_14 (pin E11) is configured as CT_INP2 */
    PORT_SetPinMux(BOARD_RC_1_RISE_PORT, BOARD_RC_1_RISE_PIN, kPORT_MuxAlt4);

    PORT0->PCR[14] = ((PORT0->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_15 (pin G13) is configured as CT_INP3 */
    PORT_SetPinMux(BOARD_RC_2_RISE_PORT, BOARD_RC_2_RISE_PIN, kPORT_MuxAlt4);

    PORT0->PCR[15] = ((PORT0->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

